import 'package:jeanswest/src/models/api_response/globalRes/aboutUs/about-us-data.dart';
import 'package:jeanswest/src/models/api_response/globalRes/aboutUs/data/card-about-us.dart';

AboutUsData aboutUsData = AboutUsData(
  banner: CardAboutUsData(
    text: "",
    picture: "",
  ),
  cards: [
    CardAboutUsData(
      text: "",
      picture: "",
    ),
  ],
);

// ! temp hardcore data
AboutUsData aboutUsTempData = AboutUsData(
  banner: CardAboutUsData(
    text:
        "کوچک‌ترین تغییرات در سبک لباس و استایل، تغییرات بزرگی را در سبک زندگی ایجاد خواهد کرد",
    picture:
        "https://www.jeanswest.ir/wp-content/uploads/2021/04/Untitled-1.jpg",
  ),
  cards: [
    CardAboutUsData(
      text:
          "در سال ۱۹۷۲، حدود چهل سال پیش، آلیستر نوروود اولین فروشگاه جین‌وست را در شهر پِرت استرالیا تأسیس کرد که در آن پوشاک سادۀ جین عرضه می‌کرد. اما تنها پانزده سال بعد جین‌وست توانست تأسیس صدمین شعبه خود را در استرالیا جشن بگیرد. با محبوبیت روزافزون این برند در بازار پرهیاهوی مد و فشن، در سال ۱۹۹۴ میلادی، جین‌وست با داشتن ۱۵۰ شعبه در سرتاسر قارۀ اقیانوسیه، قدم به آن‌سوی آب‌ها گذاشت و توانست پوشاک خود را به بازار جهانی عرضه کند. امروزه جین‌وست با بیش از 3000 شعبه در سراسر جهان یکی از بزرگ‌ترین فروشگاه‌های زنجیره‌ای پوشاک و یکی از محبوب‌ترین برندهای فست‌‌فشن و لباس روزمره در جهان به شمار می‌آید.\nبرند در بازار پرهیاهوی مد و فشن، در سال ۱۹۹۴ میلادی، جین‌وست با داشتن ۱۵۰ شعبه در سرتاسر قارۀ اقیانوسیه، قدم به آن‌سوی آب‌ها گذاشت و توانست پوشاک خود را به بازار جهانی عرضه کند. امروزه جین‌وست با بیش از 3000 شعبه در سراسر جهان یکی از بزرگ‌ترین فروشگاه‌های زنجیره‌ای پوشاک و یکی از محبوب‌ترین برندهای فست‌‌فشن و لباس روزمره در جهان به شمار می‌آید. این برند استرالیایی برای اولین بار توسط شرکت آوا‌کتان به ایران وارد و عرضه شد و امروزه با بیش از 40 شعبه و نزدیک به 60هزار مترمربع فضای تجاری در سراسر کشور،بزرگ‌ترین فروشگاه زنجیره‌ای پوشاک و مد در کشور به شمار می‌آید که مفتخر است خدمات یکسان و باکیفیتی را در کلیه‌ی شعب به مشتریان و همراهان خود تقدیم کند.",
      picture:
          "https://www.jeanswest.ir/wp-content/uploads/2020/10/tamas-ba-ma.jpg",
    ),
    CardAboutUsData(
      text:
          "جین‌وست در دسته‌بندی زنانه، مردانه و بچگانه به‌عنوان یکی از خلاق‌ترین برندهای پوشاک در سبک فست‌فشن، مد روزمره و کژوال با نوآوری و ایده‌پردازی در رنگ و طرح، به محبوبت قابل‌توجهی در میان خانواده‌های ایرانی و تمام گروه‌‌های سنی  دست یافته است.",
      picture:
          "https://www.jeanswest.ir/wp-content/uploads/2020/10/shosto-sho.jpg",
    ),
  ],
);
