import 'package:jeanswest/src/models/api_response/globalRes/faq/faq-data.dart';

List<FAQData> faqData = [
  FAQData(
    question: '',
    answer: '',
  ),
];

// ! temp hardcore data
List<FAQData> faqTempData = [
  FAQData(
    question:
        'بعد از اینکه سفارشم ثبت نهایی شد ، چه زمانی میتوانم آن را تحویل بگیرم؟',
    answer:
        ' در صورتی که دریکی از شهرهای اکسپرس هستید ، طی ثبت سفارش ، ما به شما امکان انتخاب بازه های زمانی را میدهیم و طبق بازه زمانی انتخابی کالا تحویل شما میشود.در غیر اینصورت سفارش شما از طریق پست و باربری طی 4 روز کاری تحویل شما میشود.',
  ),
  FAQData(
    question: 'چطور میتوانم سفارشم را تحویل بگیرم ؟',
    answer: '\nوارد سایت بانی مد شوید _    روی گزینه سفارش های من کلیک کنید _',
  ),
  FAQData(
    question:
        'بعد از اینکه سفارشم ثبت نهایی شد ، چه زمانی میتوانم آن را تحویل بگیرم؟',
    answer:
        ' در صورتی که دریکی از شهرهای اکسپرس هستید ، طی ثبت سفارش ، ما به شما امکان انتخاب بازه های زمانی را میدهیم و طبق بازه زمانی انتخابی کالا تحویل شما میشود.در غیر اینصورت سفارش شما از طریق پست و باربری طی 4 روز کاری تحویل شما میشود.',
  ),
];
